tap "anomalyco/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "oven-sh/bun"

brew "act"
brew "anomalyco/tap/opencode"
brew "asdf"
brew "automake"
brew "awscli"
brew "bat"
brew "cmake"
brew "coreutils"
brew "ctags", link: false
brew "curl"
brew "fd"
brew "fzf"
brew "gawk"
brew "gettext"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "gnucobol"
brew "go"
brew "golangci-lint"
brew "hashicorp/tap/hc-install"
brew "hashicorp/tap/terraform"
brew "htop"
brew "jq"
brew "libffi"
brew "libyaml"
brew "lua-language-server"
brew "lua"
brew "lynx"
brew "make"
brew "mas"
brew "neovim"
brew "ninja"
brew "node"
brew "node@22"
brew "nvim"
brew "oven-sh/bun/bun"
brew "pandoc"
brew "pastel"
brew "protobuf"
brew "pyright"
brew "python@3.12"
brew "python@3.13"
brew "ripgrep"
brew "terraform-ls"
brew "tmux"
brew "universal-ctags"
brew "watch"
brew "xz"
brew "yq"
brew "zig"
brew "zls"
brew "zoxide"

cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "ghostty"
cask "goreleaser/tap/goreleaser"
cask "keymapp"
cask "podman-desktop"
cask "raycast"

go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/dl/go1.25rc1"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/go/packages/gopackages"
go "golang.org/x/tools/gopls"
go "github.com/fullstorydev/grpcurl/cmd/grpcurl"
go "github.com/mgechev/revive"
go "honnef.co/go/tools/cmd/staticcheck"
