tap "hashicorp/tap"

brew "ack"
brew "ag"
brew "asdf"
brew "bat"
brew "cmake"
brew "curl"
brew "universal-ctags"
brew "fd"
brew "fzf"
brew "gawk"
brew "gettext"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "go"
brew "hashicorp/tap/hc-install"
brew "hashicorp/tap/terraform"
brew "htop"
brew "jq"
brew "lua"
brew "lua-language-server"
brew "make"
brew "mas"
brew "ninja"
brew "node@22"
brew "nvim"
brew "pastel"
brew "pandoc"
brew "pyright"
brew "python@3.12"
brew "python@3.13"
brew "ripgrep"
brew "tmux"
brew "terraform-ls"
brew "yq"
brew "zig"
brew "zls"
brew "zoxide"

cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-monispace-nerd-font"
cask "ghostty"
cask "keymapp"
cask "macvim"
cask "raycast"
