tap "homebrew/versions"

brew "ack"
brew "ag"
brew "awscli"
brew "cmake"
brew "consul"
brew "ctags"
brew "fzf"
brew "elixir"
brew "git"
brew "git-lfs"
brew "go"
brew "gotags"
brew "hg"
brew "htop"
brew "hub"
brew "ical-buddy"
brew "imagemagick"
brew "jq"
brew "kubectl"
brew "launchdns"
brew "mas"
brew "mtr"
brew "ponysay"
brew "qemu"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ruby-build"
brew "terraform"
brew "tmux"
brew "unrar"
brew "watch"
brew "wget"
brew "yarn"

cask "atom"
cask "dropbox"
cask "firefox"
cask "graphiql"
cask "google-chrome" unless File.exist?("/Applications/Google Chrome.app")
cask "gpgtools"
cask "google-cloud-sdk"
cask "hammerspoon"
cask "heroku-toolbelt"
cask "iterm2"
cask "lastpass"
cask "macvim"
cask "minikube"
cask "phantomjs"
cask "postgres"
cask "screenhero" unless File.exist?("/Applications/Screenhero.app")
cask "slack" unless File.exist?("/Applications/Slack.app")
cask "vagrant"
cask "virtualbox"
cask "vlc"
